# 1. 사용자로부터 초를 입력받는다.
# 2. 입력 받은 초를 분과 초로 계산한다.
# 3. 계산한 초와 분을 출력한다.

# 주의사항.
# 1. 최대한 내가 사용하는 것이 아니라, 누군가(사용자)가 사용한다는 생각으로 코딩한다.
# 2. 가급적이면, 완성도가 높은 코딩이 되도록 한다.
# 3. 변수 이름이나 함수 이름은 가급적이면 영문으로 사용하되, 딱히 영어 단어가 떠오르지 않을 경우,
# 구글링 or 사전 사용

print("=" * 50)
print("시간 계산하기")
print("=" * 50, "\n")

print("시간(초)를 입력하면 분과 초로 시간을 계산합니다.\n")

sec = input("시간(초) 입력 : ")
sec = int(sec)

# 입력한 초를 60으로 나누어서 몫을 분(minutes)로 계산해준다.
m = sec // 60

# 입력한 초를 60으로 나누어서 몫을 초(second)로 계산해준다.
s = sec % 60

print()
print(f"입력하신 {sec}초는 {m}분 {s}초입니다.")

